oplossing/cluster_2/artillery-operator/hack/examples/basic-loadtest/test-script.yaml
# In Artillery, each VU will be assigned to one of the defined
# scenarios. By default, each scenario has a weight of 1, meaning
# each scenario has the same probability of getting assigned to a
# VU.
#
# By specifying a weight in a scenario, you'll increase the chances
# of Artillery assigning the scenario for a VU. The probability of
# a scenario getting chosen depends on the total weight for all
# scenarios.
#
# To learn more, read the Artillery documentation on scenario weights:
# https://artillery.io/docs/guides/guides/test-script-reference.html#Scenario-weights

config:
  target: "http://localhost:9999"
  phases:
    - duration: 20
      arrivalRate: 75

scenarios:
  - name: "Access the /api/todo route"
    flow:
      - get:
          url: "/api/todo"